trade_exp/src/DocumentJournals/Взаимодействия/Взаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7da57c89-af2c-445a-96f7-39250f70306f">
  <name>Взаимодействия</name>
  <objectBelonging>Adopted</objectBelonging>
  <columns extendedConfigurationObject="b5b94d94-25f7-4cfa-b1e9-6009fb848763">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="a2accf54-5966-42e8-ab2e-e56e415963ee">
    <name>Входящий</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="d8eb5329-5900-4b5d-b45e-458513dddfef">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="6d521e58-24a3-4f19-b4b0-dff84f7ca86b">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="8c413fa5-9e24-4b81-aa55-0e78c5e3e20f">
    <name>Участники</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="a4322f22-7de0-4018-8e06-9f1aa7cf0c07">
    <name>СтатусИсходящегоПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="eaaed107-69d4-4963-be83-74519e331715">
    <name>УчетнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="38cddf96-8703-4396-8c73-47fb22828a48">
    <name>ЕстьВложения</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="2c2cb793-0177-4983-91ca-9c292c5b10f1">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="2a2e7f51-a4e5-48ec-b969-b1fca18ba9b5">
    <name>ПолученоОтправлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="221fa473-3327-44e6-a033-6fdfd2be713c">
    <name>Размер</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="636cb814-0c14-4574-ba90-bd5fa638378f">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="2b2bf0f7-0946-4492-bba0-27f007a70e64">
    <name>ДатаКогдаОтправить</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="9e647516-fe07-4b96-aa91-fe25fad060e2">
    <name>ДатаАктуальностиОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
  <columns extendedConfigurationObject="8be10d88-8c37-4444-9c89-6cbbe9913bda">
    <name>ИдентификаторСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </columns>
</mdclass:DocumentJournal>

trade_exp/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭлектронноеПисьмоИсходящее</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="97ec3768-2b7d-4032-a579-31ade741eb58">
    <name>ДатаКогдаОтправить</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0f6ea83-2849-4151-930d-692866919db3">
    <name>ОтправительПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2ee0d56b-cd7c-42db-8fb6-c1567fe1967d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de506523-241a-4845-9259-37066afbf16a">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="683861f9-9a5f-47db-8b03-959f839d5a3a">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e19aefe7-634d-4218-8d40-75802d1691e0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="edf11909-7d5f-4077-9cf1-90c3ef67cf64">
    <name>ДатаАктуальностиОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0510206f-eef0-4a5e-aeb7-d53c26d34adb">
    <name>ДатаОтправления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="cdd59b15-d67d-4f1b-90d4-595a9547e61d">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af5e1662-b91e-424b-8e69-e89337a96047">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DocumentJournals/Взаимодействия/Forms/ФормаСпискаПараметрическая/Module.bsl
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	Док_УстановитьОтборОснование();
КонецПроцедуры

&НаКлиенте
Процедура Док_ОснованиеПриИзмененииПосле(Элемент)
	Док_УстановитьОтборОснование();
КонецПроцедуры

&НаСервере
Процедура Док_УстановитьОтборОснование()
	// сделано, потому что УстановитьОтборПоКонтакту Ссылки сверяет, так же, как необходимо нам
	Если ЗначениеЗаполнено(Основание) И ЗначениеЗаполнено(Контакт) Тогда // это вариант, когда форма Взаимодействий открыта из Партнера или Контактного лица
		Попытка
			// модифицировано из УстановитьОтборПоКонтакту()
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	КонтактыВзаимодействий.Взаимодействие КАК Ссылка
			|ИЗ
			|	ЖурналДокументов.Взаимодействия КАК Взаимодействия
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыВзаимодействий КАК КонтактыВзаимодействий
			|		ПО (Взаимодействия.Ссылка = КонтактыВзаимодействий.Взаимодействие)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее.Основания КАК ЭлектронноеПисьмоИсходящееОснования
			|		ПО (Взаимодействия.Ссылка = ЭлектронноеПисьмоИсходящееОснования.Ссылка)
			|			И (ЭлектронноеПисьмоИсходящееОснования.Документ = &Документ)
			|ГДЕ
			|	КонтактыВзаимодействий.Контакт В(&Контакт)");
					
			МассивПараметрКонтакт = ПараметрКонтактВЗависимостиОтТипа(Контакт);
			Если МассивПараметрКонтакт.Количество() = 0 Тогда
				МассивПараметрКонтакт.Добавить(Контакт);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Контакт", МассивПараметрКонтакт);
			Запрос.УстановитьПараметр("Документ", Основание);
			
			СписокОтбора = Новый СписокЗначений;
			СписокОтбора.ЗагрузитьЗначения(
			Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		Исключение
			Сообщить("Фильтр по Основанию не применен" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Сообщить(Контакт);
		КонецПопытки;
	ИначеЕсли ЗначениеЗаполнено(Основание) Тогда // это вариант, если Форма открыта из Взаимодействия
		Попытка
			// модифицировано из УстановитьОтборПоКонтакту()
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Взаимодействия.Ссылка КАК Ссылка
			|ИЗ
			|	ЖурналДокументов.Взаимодействия КАК Взаимодействия
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее.Основания КАК ЭлектронноеПисьмоИсходящееОснования
			|		ПО (Взаимодействия.Ссылка = ЭлектронноеПисьмоИсходящееОснования.Ссылка)
			|			И (ЭлектронноеПисьмоИсходящееОснования.Документ = &Документ)");
			
			Запрос.УстановитьПараметр("Документ", Основание);
			
			СписокОтбора = Новый СписокЗначений;
			СписокОтбора.ЗагрузитьЗначения(
			Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		Исключение
			Сообщить("Фильтр по Основанию не применен" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Сообщить(Контакт);
		КонецПопытки;
	ИначеЕсли ЗначениеЗаполнено(Контакт) Тогда // вариант, если Основание не заполнено, но открыто из Партнера или Контактного лица
		УстановитьОтборПоКонтакту();
	Иначе // вариант, когда открыто из Взаимодействия, и Основание не заполнено
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ОснованиеНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Контакт) Тогда
		Партнер_ = ПолучитьПартнераПоКонтакту(Контакт);
		Если ЗначениеЗаполнено(Партнер_) Тогда
			ПараметрыОткрытия.Вставить("Партнер", Партнер_);
		КонецЕсли;
	КонецЕсли;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",ПараметрыОткрытия,ЭтаФорма,УникальныйИдентификатор,,,ОбработкаВыбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПартнераПоКонтакту(Контакт)
	Возврат ?(ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры"), Контакт,
				?(ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров"), Контакт.Владелец,
					?(ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты"), Контакт.Партнер, Неопределено)
					)
				)
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
    Основание = Значение;
	Док_УстановитьОтборОснование();
КонецПроцедуры
